{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_11487","layers":[{"class_name":"Dense","config":{"units":18,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense22973","trainable":true,"batch_input_shape":[null,24],"dtype":"float32"}},{"class_name":"Dense","config":{"units":4,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense22974","trainable":true}}]},"keras_version":"tfjs-layers 3.19.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.19.0","convertedBy":null,"weightsManifest":[{"paths":["./best_snake.weights.bin"],"weights":[{"name":"dense_Dense22973/kernel","shape":[24,18],"dtype":"float32"},{"name":"dense_Dense22973/bias","shape":[18],"dtype":"float32"},{"name":"dense_Dense22974/kernel","shape":[18,4],"dtype":"float32"},{"name":"dense_Dense22974/bias","shape":[4],"dtype":"float32"}]}]}