{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_6764",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 8,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense13527",
            "trainable": true,
            "batch_input_shape": [null, 5],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 2,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense13528",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 3.19.0",
    "backend": "tensor_flow.js"
  },
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v3.19.0",
  "convertedBy": null,
  "weightsManifest": [
    {
      "paths": ["./best_bird.weights.bin"],
      "weights": [
        {
          "name": "dense_Dense13527/kernel",
          "shape": [5, 8],
          "dtype": "float32"
        },
        { "name": "dense_Dense13527/bias", "shape": [8], "dtype": "float32" },
        {
          "name": "dense_Dense13528/kernel",
          "shape": [8, 2],
          "dtype": "float32"
        },
        { "name": "dense_Dense13528/bias", "shape": [2], "dtype": "float32" }
      ]
    }
  ]
}
